"""
1.  Напишите программу, чтобы найти значение указанного выражения. 
a)  101 + 0) / 3
b) 3.0e-6 * 10000000.1
c) true && true
d) false && true
e) (false && false) (true && true)
f) (false false) && (true && true)
2.  Напишите программу, которая принимает четыре целых числа от пользователя и выводит надпись равно, если все четыре равны, и не равно в противном случае. 
3.  Напишите программу для поиска k самых больших элементов в заданном массиве. Элементы в массиве могут располагаться в любом порядке.
4.  Напишите программу для поиска k наименьших элементов в заданном массиве. Элементы в массиве могут располагаться в любом порядке.
5.  Напишите программу для поиска чисел, превышающих среднее значение чисел данного массива. 
6.  Напишите программу для умножения двух заданных целых чисел без использования оператора умножения(*).
7.  Напишите для разбиения заданного массива целых чисел на четное число первым и нечетное число вторым.
8.  Напишите програмиу для преобразования температуры из градуса Фаренгейта в градус Цельсия. 
9.  Напишите программу для вычисления индекса массы тела (ИМТ). ИМТ = ВЕС / РОСТ2
10.  Напишите, которая считывает число и отображает квадрат, куб и четвертую степень. 
11.  Напишите программу, чтобы проверить, могут ли три заданные длины сторон (целые числа) образовать треугольник или нет.
"""

import modules.oct15.ex1
import modules.oct15.ex2
import modules.oct15.ex3
import modules.oct15.ex4
import modules.oct15.ex5
import modules.oct15.ex6
import modules.oct15.ex7
import modules.oct15.ex8
import modules.oct15.ex9
import modules.oct15.ex10
import modules.oct15.ex11

module_list = [ex1.Child, ex2.Child, ex3.Child,
               ex4.Child, ex5.Child, ex6.Child,
               ex7.Child, ex8.Child, ex9.Child,
               ex10.Child, ex11.Child,
               ]
